Revit 2027 API
FabricationConfiguration.GetAllSpecifications Method
 Gets all specification identifiers in the fabrication configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetAllSpecifications(
	FabricationPart part
)
Public Function GetAllSpecifications (
	part As FabricationPart
) As IList(Of Integer)
public:
IList<int>^ GetAllSpecifications(
	FabricationPart^ part
)
member GetAllSpecifications :
        part : FabricationPart -> IList<int>
Parameters
part FabricationPart
 The fabrication part.
Return Value
IList<Int32>
 An array of specification identifiers.
Remarks
 If a part is passed, only returns specifications which are valid for the part, otherwise returns all specifications.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace